## Plan Result (push-server-cdk)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/246717)


### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!


<pre><code>Plan: 1 to add, 1 to change, 2 to destroy.</code></pre>

* Update
  * aws_ecs_service.application_ecs_service_ecs-service_A8BAB5F4
* Delete
  * aws_cloudwatch_log_group.aws-otel-collector-log-group
* Replace
  * aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4



<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_cloudwatch_log_group.aws-otel-collector-log-group will be destroyed
  # (because aws_cloudwatch_log_group.aws-otel-collector-log-group is not in configuration)
  - resource "aws_cloudwatch_log_group" "aws-otel-collector-log-group" {
      - arn               = "arn:aws:logs:us-east-1:996905175585:log-group:/Backend/Push-Prod/ecs/aws-otel-collector" -> null
      - id                = "/Backend/Push-Prod/ecs/aws-otel-collector" -> null
      - log_group_class   = "STANDARD" -> null
      - name              = "/Backend/Push-Prod/ecs/aws-otel-collector" -> null
      - retention_in_days = 90 -> null
      - skip_destroy      = true -> null
      - tags              = {
          - "app_code"       = "pocket"
          - "component_code" = "pocket-push"
          - "costCenter"     = "Pocket"
          - "env_code"       = "prod"
          - "environment"    = "Prod"
          - "owner"          = "Pocket"
          - "service"        = "Push"
        } -> null
      - tags_all          = {
          - "app_code"       = "pocket"
          - "component_code" = "pocket-push"
          - "costCenter"     = "Pocket"
          - "env_code"       = "prod"
          - "environment"    = "Prod"
          - "owner"          = "Pocket"
          - "service"        = "Push"
        } -> null
        # (2 unchanged attributes hidden)
    }

  # aws_ecs_service.application_ecs_service_ecs-service_A8BAB5F4 will be updated in-place
  ~ resource "aws_ecs_service" "application_ecs_service_ecs-service_A8BAB5F4" {
        id                                 = "arn:aws:ecs:us-east-1:996905175585:service/Push-Prod/Push-Prod"
        name                               = "Push-Prod"
        tags                               = {
            "app_code"       = "pocket"
            "component_code" = "pocket-push"
            "costCenter"     = "Pocket"
            "env_code"       = "prod"
            "environment"    = "Prod"
            "owner"          = "Pocket"
            "service"        = "Push"
        }
      ~ task_definition                    = "arn:aws:ecs:us-east-1:996905175585:task-definition/Push-Prod:102" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4 must be replaced
-/+ resource "aws_ecs_task_definition" "application_ecs_service_ecs-task_461CC9D4" {
      ~ arn                      = "arn:aws:ecs:us-east-1:996905175585:task-definition/Push-Prod:102" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-1:996905175585:task-definition/Push-Prod" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
                {
                    cpu                    = 0
                    environment            = [
                        {
                            name  = "JOB_QUEUE_URL"
                            value = "https://sqs.us-east-1.amazonaws.com/996905175585/pocket-push-queue"
                        },
                        {
                            name  = "NODE_ENV"
                            value = "production"
                        },
                        {
                            name  = "TOKEN_QUEUE_URL"
                            value = "https://sqs.us-east-1.amazonaws.com/996905175585/pocket-push-feedback-queue"
                        },
                    ]
                    essential              = true
                    image                  = "996905175585.dkr.ecr.us-east-1.amazonaws.com/push-prod-app:latest"
                    logConfiguration       = {
                        logDriver     = "awslogs"
                        options       = {
                            awslogs-group             = "/Backend/Push-Prod/ecs/app"
                            awslogs-multiline-pattern = "^\\S.+"
                            awslogs-region            = "us-east-1"
                            awslogs-stream-prefix     = "ecs"
                        }
                        secretOptions = []
                    }
                    mountPoints            = []
                    name                   = "app"
                    portMappings           = []
                    readonlyRootFilesystem = false
                    secrets                = [
                        {
                            name      = "APNS_BETA_BUNDLE_ID"
                            valueFrom = "arn:aws:ssm:us-east-1:996905175585:parameter/Push/Prod/APNS_BETA_BUNDLE_ID"
                        },
                        {
                            name      = "APNS_KEY_ID"
                            valueFrom = "arn:aws:ssm:us-east-1:996905175585:parameter/Push/Prod/APNS_KEY_ID"
                        },
                        {
                            name      = "APNS_P8_KEY"
                            valueFrom = "arn:aws:ssm:us-east-1:996905175585:parameter/Push/Prod/APNS_P8_KEY"
                        },
                        {
                            name      = "APNS_PROD_BUNDLE_ID"
                            valueFrom = "arn:aws:ssm:us-east-1:996905175585:parameter/Push/Prod/APNS_PROD_BUNDLE_ID"
                        },
                        {
                            name      = "APNS_TEAM_ID"
                            valueFrom = "arn:aws:ssm:us-east-1:996905175585:parameter/Push/Prod/APNS_TEAM_ID"
                        },
                        {
                            name      = "GCM_CLIENT_EMAIL"
                            valueFrom = "arn:aws:ssm:us-east-1:996905175585:parameter/Push/Prod/GCM_CLIENT_EMAIL"
                        },
                        {
                            name      = "GCM_PRIVATE_KEY"
                            valueFrom = "arn:aws:ssm:us-east-1:996905175585:parameter/Push/Prod/GCM_PRIVATE_KEY"
                        },
                        {
                            name      = "GCM_PROJECT_ID"
                            valueFrom = "arn:aws:ssm:us-east-1:996905175585:parameter/Push/Prod/GCM_PROJECT_ID"
                        },
                        {
                            name      = "NUMBER_OF_WORKERS"
                            valueFrom = "arn:aws:ssm:us-east-1:996905175585:parameter/Push/Prod/NUMBER_OF_WORKERS"
                        },
                        {
                            name      = "SENTRY_DSN"
                            valueFrom = "arn:aws:ssm:us-east-1:996905175585:parameter/Push/Prod/SENTRY_DSN"
                        },
                        {
                            name      = "TIME_BETWEEN_RESTARTS"
                            valueFrom = "arn:aws:ssm:us-east-1:996905175585:parameter/Push/Prod/TIME_BETWEEN_RESTARTS"
                        },
                    ]
                    systemControls         = []
                    volumesFrom            = []
                },
              - {
                  - command                = [
                      - "--config=/etc/ecs/ecs-xray.yaml",
                    ]
                  - cpu                    = 0
                  - environment            = []
                  - essential              = true
                  - image                  = "amazon/aws-otel-collector"
                  - logConfiguration       = {
                      - logDriver     = "awslogs"
                      - options       = {
                          - awslogs-group             = "/Backend/Push-Prod/ecs/aws-otel-collector"
                          - awslogs-multiline-pattern = "^\\S.+"
                          - awslogs-region            = "us-east-1"
                          - awslogs-stream-prefix     = "ecs"
                        }
                      - secretOptions = []
                    }
                  - mountPoints            = []
                  - name                   = "aws-otel-collector"
                  - portMappings           = [
                      - {
                          - containerPort = 4138
                          - hostPort      = 4138
                          - protocol      = "tcp"
                        },
                      - {
                          - containerPort = 4137
                          - hostPort      = 4137
                          - protocol      = "tcp"
                        },
                    ]
                  - readonlyRootFilesystem = false
                  - repositoryCredentials  = {
                      - credentialsParameter = "arn:aws:secretsmanager:us-east-1:996905175585:secret:Shared/DockerHub"
                    }
                  - systemControls         = []
                  - volumesFrom            = []
                },
            ] # forces replacement
        )
      ~ id                       = "Push-Prod" -> (known after apply)
      ~ revision                 = 102 -> (known after apply)
        tags                     = {
            "app_code"       = "pocket"
            "component_code" = "pocket-push"
            "costCenter"     = "Pocket"
            "env_code"       = "prod"
            "environment"    = "Prod"
            "owner"          = "Pocket"
            "service"        = "Push"
        }
        # (12 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 2 to destroy.
```

</details>









<!-- github-comment: {"Command":"plan","JobID":"549c465b-54f1-411e-b146-97be68a9bc76","JobName":"push-server_infrastructure_plan_prod","PRNumber":675,"Program":"tfcmt","SHA1":"43abfa663c90642dd0745cde44ee02d4f29fd3f4","Target":"push-server-cdk","Vars":{}} -->